# Pandas 

In this notebook we are going to dig deeper into the Pandas package. From creating a DataFrame, to make simple operations with the dataframe. The last part will cover how to import data and manipulate DataFrames

## Introduction

In [1]:
import numpy as np
import pandas as pd

Define a dataframe with Pandas

In [2]:
icecream_sales = np.array([30, 40, 35, 130, 120, 60])
weather_coded = np.array([0, 1, 0, 1, 1, 0])
customers = np.array([2000, 2100, 1500, 8000, 7200, 2000])
df = pd.DataFrame({'icecream_sales': icecream_sales,
                   'weather_coded': weather_coded,
                   'customers': customers})

Define and assign an index (six ends of month starting in April, 2010)

In [3]:
ourIndex = pd.date_range(start='04/2010', freq='M', periods=6)
df.set_index(ourIndex, inplace=True)

Print the DataFrame

In [4]:
print(f'df: \n{df}\n')

df:
            icecream_sales  weather_coded  customers
2010-04-30              30              0       2000
2010-05-31              40              1       2100
2010-06-30              35              0       1500
2010-07-31             130              1       8000
2010-08-31             120              1       7200
2010-09-30              60              0       2000

Access columns by variable names

In [5]:
subset1 = df[['icecream_sales', 'customers']]
print(f'subset1: \n{subset1}\n')

subset1:
            icecream_sales  customers
2010-04-30              30       2000
2010-05-31              40       2100
2010-06-30              35       1500
2010-07-31             130       8000
2010-08-31             120       7200
2010-09-30              60       2000

Access second to fourth row

In [6]:
subset2 = df[1:4]  # same as df['2010-05-31':'2010-07-31']
print(f'subset2: \n{subset2}\n')

subset2:
            icecream_sales  weather_coded  customers
2010-05-31              40              1       2100
2010-06-30              35              0       1500
2010-07-31             130              1       8000

Access rows and columns by index and variable names:

In [7]:
subset3 = df.loc['2010-05-31', 'customers']  # same as df.iloc[1,2]
print(f'subset3: \n{subset3}\n')

subset3:
2100

Access rows and columns by index and variable integer positions:

In [8]:
subset4 = df.iloc[1:4, 0:2]
print(f'subset4: \n{subset4}\n')

subset4:
            icecream_sales  weather_coded
2010-05-31              40              1
2010-06-30              35              0
2010-07-31             130              1

## DataFrame manipulation

We are going to see now some of the operations that can be done based on the constructed data frame

Include sales two months ago

In [9]:
df['icecream_sales_lag2'] = df['icecream_sales'].shift(2)
print(f'df: \n{df}\n')

df:
            icecream_sales  weather_coded  customers  icecream_sales_lag2
2010-04-30              30              0       2000                  NaN
2010-05-31              40              1       2100                  NaN
2010-06-30              35              0       1500                 30.0
2010-07-31             130              1       8000                 40.0
2010-08-31             120              1       7200                 35.0
2010-09-30              60              0       2000                130.0

Use a pandas.Categorical object to attach labels (0 = bad; 1 = good):

In [11]:
df['weather'] = pd.Categorical.from_codes(codes=df['weather_coded'],
                                          categories=['bad', 'good'])
print(f'df: \n{df}\n')

df:
            icecream_sales  weather_coded  customers  icecream_sales_lag2  \
2010-04-30              30              0       2000                  NaN
2010-05-31              40              1       2100                  NaN
2010-06-30              35              0       1500                 30.0
2010-07-31             130              1       8000                 40.0
2010-08-31             120              1       7200                 35.0
2010-09-30              60              0       2000                130.0

           weather
2010-04-30     bad
2010-05-31    good
2010-06-30     bad
2010-07-31    good
2010-08-31    good
2010-09-30     bad

Calculate the mean sales for each wheather category:

In [12]:
group_means = df.groupby('weather').mean()
print(f'group_means: \n{group_means}\n')

group_means:
         icecream_sales  weather_coded    customers  icecream_sales_lag2
weather
bad           41.666667            0.0  1833.333333                 80.0
good          96.666667            1.0  5766.666667                 37.5

Calculated the median sales for each wheather category:

In [14]:
group_means = df.groupby('weather').median()
print(f'group_means: \n{group_means}\n')

group_means:
         icecream_sales  weather_coded  customers  icecream_sales_lag2
weather
bad                  35              0       2000                 80.0
good                120              1       7200                 37.5

## Uploading real datasets

In this section we are going to see how to work with real datasets. The data set contains information about credit card debt for 10,000 customers.

In [10]:
df = pd.read_csv('C:/Users/USER/Codes_JupyterLab/2/Credit.csv')
df.set_index('Id')

,Income,Limit,Rating,Cards,Age,Education,Own,Student,Married,Region,Balance
Id,,,,,,,,,,,
1,14.891,3606,283,2,34,11,No,No,Yes,South,333
2,106.025,6645,483,3,82,15,Yes,Yes,Yes,West,903
3,104.593,7075,514,4,71,11,No,No,No,West,580
4,148.924,9504,681,3,36,11,Yes,No,No,West,964
5,55.882,4897,357,2,68,16,No,No,Yes,South,331
...,...,...,...,...,...,...,...,...,...,...,...
396,12.096,4100,307,3,32,13,No,No,Yes,South,560
397,13.364,3838,296,5,65,17,No,No,No,East,480
398,57.872,4171,321,5,67,12,Yes,No,Yes,South,138
399,37.728,2525,192,1,44,13,No,No,Yes,South,0
400,18.701,5524,415,5,64,7,Yes,No,No,West,966

In [6]:
df.shape

(400, 12)

In [7]:
df.columns

Index(['Id', 'Income', 'Limit', 'Rating', 'Cards', 'Age', 'Education', 'Own',
       'Student', 'Married', 'Region', 'Balance'],
      dtype='object')

Dropping columns

In [11]:
df.drop(['Cards'], axis = 1, inplace = True)

Select particular columns while reading the file

In [12]:
df_spec = pd.read_csv('Credit.csv', usecols = ['Id','Limit','Rating','Income']) #specifying the subsets needed by using column name
df_spec.set_index('Id')

      Income  Limit  Rating
Id
1     14.891   3606     283
2    106.025   6645     483
3    104.593   7075     514
4    148.924   9504     681
5     55.882   4897     357
..       ...    ...     ...
396   12.096   4100     307
397   13.364   3838     296
398   57.872   4171     321
399   37.728   2525     192
400   18.701   5524     415

[400 rows x 3 columns]

Select a random sample of observations from the larger dataset

In [13]:
df_spec = df.sample(n=100)
df_spec.shape

(100, 11)

In [19]:
df_spec = df.sample(frac=0.5) #frac: the portion of overall data
df_spec.shape

(200, 11)

Checking for missing values

In [17]:
df.isna().sum() #.isna(): value that are NA

Id           0
Income       0
Limit        0
Rating       0
Age          0
Education    0
Own          0
Student      0
Married      0
Region       0
Balance      0
dtype: int64

Clearly, there are no missing value in the dataset. Just to practice let's add some missing values randomly in the dataset.

Let's first create 20 random indices to select. We will use these indexes to change some values as np.nan (missing value).

In [20]:
missing_index = np.random.randint(300, size = 20)

In [21]:
df.loc[missing_index, ['Limit','Education']] = np.nan

In [23]:
df.isna().sum()

Id            0
Income        0
Limit        18
Rating        0
Age           0
Education    18
Own           0
Student       0
Married       0
Region        0
Balance       0
dtype: int64

Filling missing values. One simplest example is to fill the nan values with the mean.

In [24]:
avg = df['Limit'].mean()
df['Limit'].fillna(value = avg, inplace = True)

In [25]:
df.isna().sum()

Id            0
Income        0
Limit         0
Rating        0
Age           0
Education    18
Own           0
Student       0
Married       0
Region        0
Balance       0
dtype: int64

Another alternative could be just drop the missing values in the data.

In [26]:
df.dropna(axis = 0, how = 'any', inplace = True)

In [27]:
df.isna().sum()

Id           0
Income       0
Limit        0
Rating       0
Age          0
Education    0
Own          0
Student      0
Married      0
Region       0
Balance      0
dtype: int64

Reset the index of the dataframe

In [28]:
df.reset_index()

,index,Id,Income,Limit,Rating,Age,Education,Own,Student,Married,Region,Balance
0,0,1,14.891,3606.0,283,34,11.0,No,No,Yes,South,333
1,1,2,106.025,6645.0,483,82,15.0,Yes,Yes,Yes,West,903
2,2,3,104.593,7075.0,514,71,11.0,No,No,No,West,580
3,3,4,148.924,9504.0,681,36,11.0,Yes,No,No,West,964
4,4,5,55.882,4897.0,357,68,16.0,No,No,Yes,South,331
...,...,...,...,...,...,...,...,...,...,...,...,...
377,395,396,12.096,4100.0,307,32,13.0,No,No,Yes,South,560
378,396,397,13.364,3838.0,296,65,17.0,No,No,No,East,480
379,397,398,57.872,4171.0,321,67,12.0,Yes,No,Yes,South,138
380,398,399,37.728,2525.0,192,44,13.0,No,No,Yes,South,0
381,399,400,18.701,5524.0,415,64,7.0,Yes,No,No,West,966